 /* acctrec.cpy                                                      */
         2 ACCTDO                   char(5),
         2 SNAMEDO                  char(18),
         2 FNAMEDO                  char(12),
         2 MIDO                     char(1),
         2 TTLDO                    char(4),
         2 TELDO                    char(10),
         2 ADDR1DO                  char(24),
         2 ADDR2DO                  char(24),
         2 ADDR3DO                  char(24),
         2 AUTH1DO                  char(32),
         2 AUTH2DO                  char(32),
         2 AUTH3DO                  char(32),
         2 AUTH4DO                  char(32),
         2 CARDSDO                  char(1),
         2 IMODO                    char(2),
         2 IDAYDO                   char(2),
         2 IYRDO                    char(2),
         2 RSNDO                    char(1),
         2 CCODEDO                  char(1),
         2 APPRDO                   char(3),
         2 SCODE1DO                 char(1),
         2 SCODE2DO                 char(1),
         2 SCODE3DO                 char(1),
         2 STATDO                   char(2),
         2 LIMITDO                  char(8),
         2 PAY_HIST(3),
           4 BAL                    char(8),
           4 BMO                    pic '99',
           4 BDAY                   pic '99',
           4 BYR                    pic '99',
           4 BAMT                   char(8),
           4 PMO                    pic '99',
           4 PDAY                   pic '99',
           4 PYR                    pic '99',
           4 PAMT                   char(8),
         2 * char(0);
