//MFIDSACI JOB 'CICS JOB',MSGCLASS=A
//CICS     EXEC PGM=NOTUSED
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//PLIDUMP  DD SYSOUT=*,DCB=(RECFM=F,LRECL=133),HOLD=Y
//
