 DECLARE 1 ACCTMNUI AUTOMATIC UNALIGNED,
    3 DFHMS1 CHARACTER (12),
    3 SNAMEML FIXED BINARY (15,0),
    3 SNAMEMF CHARACTER (1),
    3 DFHMS2  CHARACTER (4),
    3 SNAMEMI CHARACTER (12),
    3 FNAMEML FIXED BINARY (15,0),
    3 FNAMEMF CHARACTER (1),
    3 DFHMS3  CHARACTER (4),
    3 FNAMEMI CHARACTER (7),
    3 REQML FIXED BINARY (15,0),
    3 REQMF CHARACTER (1),
    3 DFHMS4  CHARACTER (4),
    3 REQMI CHARACTER (1),
    3 ACCTML FIXED BINARY (15,0),
    3 ACCTMF CHARACTER (1),
    3 DFHMS5  CHARACTER (4),
    3 ACCTMI CHARACTER (5),
    3 PRTRML FIXED BINARY (15,0),
    3 PRTRMF CHARACTER (1),
    3 DFHMS6  CHARACTER (4),
    3 PRTRMI CHARACTER (4),
    3 SUMTTLML FIXED BINARY (15,0),
    3 SUMTTLMF CHARACTER (1),
    3 DFHMS7  CHARACTER (4),
    3 SUMTTLMI CHARACTER (79),
    3 SUMLNMD(6),
       5 SUMLNML FIXED BINARY (15,0),
       5 SUMLNMF CHARACTER (1),
       5 DFHMS8  CHARACTER (4),
       5 SUMLNMI CHARACTER (79),
    3 MSGML FIXED BINARY (15,0),
    3 MSGMF CHARACTER (1),
    3 DFHMS9  CHARACTER (4),
    3 MSGMI CHARACTER (70),
    3 DFHMS10 CHARACTER(1);

 DECLARE 1 ACCTMNUO BASED(ADDR(ACCTMNUI)) UNALIGNED,
    3 DFHMS11 CHARACTER (12),
    3 DFHMS12 FIXED BINARY (15,0),
    3 SNAMEMA CHARACTER (1),
    3 SNAMEMC CHARACTER (1),
    3 SNAMEMP CHARACTER (1),
    3 SNAMEMH CHARACTER (1),
    3 SNAMEMV CHARACTER (1),
    3 SNAMEMO CHARACTER (12),
    3 DFHMS13 FIXED BINARY (15,0),
    3 FNAMEMA CHARACTER (1),
    3 FNAMEMC CHARACTER (1),
    3 FNAMEMP CHARACTER (1),
    3 FNAMEMH CHARACTER (1),
    3 FNAMEMV CHARACTER (1),
    3 FNAMEMO CHARACTER (7),
    3 DFHMS14 FIXED BINARY (15,0),
    3 REQMA CHARACTER (1),
    3 REQMC CHARACTER (1),
    3 REQMP CHARACTER (1),
    3 REQMH CHARACTER (1),
    3 REQMV CHARACTER (1),
    3 REQMO CHARACTER (1),
    3 DFHMS15 FIXED BINARY (15,0),
    3 ACCTMA CHARACTER (1),
    3 ACCTMC CHARACTER (1),
    3 ACCTMP CHARACTER (1),
    3 ACCTMH CHARACTER (1),
    3 ACCTMV CHARACTER (1),
    3 ACCTMO CHARACTER (5),
    3 DFHMS16 FIXED BINARY (15,0),
    3 PRTRMA CHARACTER (1),
    3 PRTRMC CHARACTER (1),
    3 PRTRMP CHARACTER (1),
    3 PRTRMH CHARACTER (1),
    3 PRTRMV CHARACTER (1),
    3 PRTRMO CHARACTER (4),
    3 DFHMS17 FIXED BINARY (15,0),
    3 SUMTTLMA CHARACTER (1),
    3 SUMTTLMC CHARACTER (1),
    3 SUMTTLMP CHARACTER (1),
    3 SUMTTLMH CHARACTER (1),
    3 SUMTTLMV CHARACTER (1),
    3 SUMTTLMO CHARACTER (79),
    3 DFHMS18(6),
       5 DFHMS19 FIXED BINARY (15,0),
       5 SUMLNMA CHARACTER (1),
       5 SUMLNMC CHARACTER (1),
       5 SUMLNMP CHARACTER (1),
       5 SUMLNMH CHARACTER (1),
       5 SUMLNMV CHARACTER (1),
       5 SUMLNMO CHARACTER (79),
    3 DFHMS20 FIXED BINARY (15,0),
    3 MSGMA CHARACTER (1),
    3 MSGMC CHARACTER (1),
    3 MSGMP CHARACTER (1),
    3 MSGMH CHARACTER (1),
    3 MSGMV CHARACTER (1),
    3 MSGMO CHARACTER (70),
    3 DFHMS21 CHARACTER(1);

 /* END OF MAP DEFINITION */

 DECLARE 1 ACCTDTLI AUTOMATIC UNALIGNED,
    3 DFHMS22 CHARACTER (12),
    3 TITLEDL FIXED BINARY (15,0),
    3 TITLEDF CHARACTER (1),
    3 DFHMS23  CHARACTER (4),
    3 TITLEDI CHARACTER (14),
    3 ACCTDL FIXED BINARY (15,0),
    3 ACCTDF CHARACTER (1),
    3 DFHMS24  CHARACTER (4),
    3 ACCTDI CHARACTER (5),
    3 SNAMEDL FIXED BINARY (15,0),
    3 SNAMEDF CHARACTER (1),
    3 DFHMS25  CHARACTER (4),
    3 SNAMEDI CHARACTER (18),
    3 FNAMEDL FIXED BINARY (15,0),
    3 FNAMEDF CHARACTER (1),
    3 DFHMS26  CHARACTER (4),
    3 FNAMEDI CHARACTER (12),
    3 MIDL FIXED BINARY (15,0),
    3 MIDF CHARACTER (1),
    3 DFHMS27  CHARACTER (4),
    3 MIDI CHARACTER (1),
    3 TTLDL FIXED BINARY (15,0),
    3 TTLDF CHARACTER (1),
    3 DFHMS28  CHARACTER (4),
    3 TTLDI CHARACTER (4),
    3 TELDL FIXED BINARY (15,0),
    3 TELDF CHARACTER (1),
    3 DFHMS29  CHARACTER (4),
    3 TELDI CHARACTER (10),
    3 ADDR1DL FIXED BINARY (15,0),
    3 ADDR1DF CHARACTER (1),
    3 DFHMS30  CHARACTER (4),
    3 ADDR1DI CHARACTER (24),
    3 ADDR2DL FIXED BINARY (15,0),
    3 ADDR2DF CHARACTER (1),
    3 DFHMS31  CHARACTER (4),
    3 ADDR2DI CHARACTER (24),
    3 ADDR3DL FIXED BINARY (15,0),
    3 ADDR3DF CHARACTER (1),
    3 DFHMS32  CHARACTER (4),
    3 ADDR3DI CHARACTER (24),
    3 AUTH1DL FIXED BINARY (15,0),
    3 AUTH1DF CHARACTER (1),
    3 DFHMS33  CHARACTER (4),
    3 AUTH1DI CHARACTER (32),
    3 AUTH2DL FIXED BINARY (15,0),
    3 AUTH2DF CHARACTER (1),
    3 DFHMS34  CHARACTER (4),
    3 AUTH2DI CHARACTER (32),
    3 AUTH3DL FIXED BINARY (15,0),
    3 AUTH3DF CHARACTER (1),
    3 DFHMS35  CHARACTER (4),
    3 AUTH3DI CHARACTER (32),
    3 AUTH4DL FIXED BINARY (15,0),
    3 AUTH4DF CHARACTER (1),
    3 DFHMS36  CHARACTER (4),
    3 AUTH4DI CHARACTER (32),
    3 CARDSDL FIXED BINARY (15,0),
    3 CARDSDF CHARACTER (1),
    3 DFHMS37  CHARACTER (4),
    3 CARDSDI CHARACTER (1),
    3 IMODL FIXED BINARY (15,0),
    3 IMODF CHARACTER (1),
    3 DFHMS38  CHARACTER (4),
    3 IMODI CHARACTER (2),
    3 IDAYDL FIXED BINARY (15,0),
    3 IDAYDF CHARACTER (1),
    3 DFHMS39  CHARACTER (4),
    3 IDAYDI CHARACTER (2),
    3 IYRDL FIXED BINARY (15,0),
    3 IYRDF CHARACTER (1),
    3 DFHMS40  CHARACTER (4),
    3 IYRDI CHARACTER (2),
    3 RSNDL FIXED BINARY (15,0),
    3 RSNDF CHARACTER (1),
    3 DFHMS41  CHARACTER (4),
    3 RSNDI CHARACTER (1),
    3 CCODEDL FIXED BINARY (15,0),
    3 CCODEDF CHARACTER (1),
    3 DFHMS42  CHARACTER (4),
    3 CCODEDI CHARACTER (1),
    3 APPRDL FIXED BINARY (15,0),
    3 APPRDF CHARACTER (1),
    3 DFHMS43  CHARACTER (4),
    3 APPRDI CHARACTER (3),
    3 SCODE1DL FIXED BINARY (15,0),
    3 SCODE1DF CHARACTER (1),
    3 DFHMS44  CHARACTER (4),
    3 SCODE1DI CHARACTER (1),
    3 SCODE2DL FIXED BINARY (15,0),
    3 SCODE2DF CHARACTER (1),
    3 DFHMS45  CHARACTER (4),
    3 SCODE2DI CHARACTER (1),
    3 SCODE3DL FIXED BINARY (15,0),
    3 SCODE3DF CHARACTER (1),
    3 DFHMS46  CHARACTER (4),
    3 SCODE3DI CHARACTER (1),
    3 STATTLDL FIXED BINARY (15,0),
    3 STATTLDF CHARACTER (1),
    3 DFHMS47  CHARACTER (4),
    3 STATTLDI CHARACTER (15),
    3 STATDL FIXED BINARY (15,0),
    3 STATDF CHARACTER (1),
    3 DFHMS48  CHARACTER (4),
    3 STATDI CHARACTER (2),
    3 LIMTTLDL FIXED BINARY (15,0),
    3 LIMTTLDF CHARACTER (1),
    3 DFHMS49  CHARACTER (4),
    3 LIMTTLDI CHARACTER (18),
    3 LIMITDL FIXED BINARY (15,0),
    3 LIMITDF CHARACTER (1),
    3 DFHMS50  CHARACTER (4),
    3 LIMITDI CHARACTER (8),
    3 HISTTLDL FIXED BINARY (15,0),
    3 HISTTLDF CHARACTER (1),
    3 DFHMS51  CHARACTER (4),
    3 HISTTLDI CHARACTER (71),
    3 HIST1DL FIXED BINARY (15,0),
    3 HIST1DF CHARACTER (1),
    3 DFHMS52  CHARACTER (4),
    3 HIST1DI CHARACTER (61),
    3 HIST2DL FIXED BINARY (15,0),
    3 HIST2DF CHARACTER (1),
    3 DFHMS53  CHARACTER (4),
    3 HIST2DI CHARACTER (61),
    3 HIST3DL FIXED BINARY (15,0),
    3 HIST3DF CHARACTER (1),
    3 DFHMS54  CHARACTER (4),
    3 HIST3DI CHARACTER (61),
    3 MSGDL FIXED BINARY (15,0),
    3 MSGDF CHARACTER (1),
    3 DFHMS55  CHARACTER (4),
    3 MSGDI CHARACTER (70),
    3 VFYDL FIXED BINARY (15,0),
    3 VFYDF CHARACTER (1),
    3 DFHMS56  CHARACTER (4),
    3 VFYDI CHARACTER (1),
    3 DFHMS57 CHARACTER(1);

 DECLARE 1 ACCTDTLO BASED(ADDR(ACCTDTLI)) UNALIGNED,
    3 DFHMS58 CHARACTER (12),
    3 DFHMS59 FIXED BINARY (15,0),
    3 TITLEDA CHARACTER (1),
    3 TITLEDC CHARACTER (1),
    3 TITLEDP CHARACTER (1),
    3 TITLEDH CHARACTER (1),
    3 TITLEDV CHARACTER (1),
    3 TITLEDO CHARACTER (14),
    3 DFHMS60 FIXED BINARY (15,0),
    3 ACCTDA CHARACTER (1),
    3 ACCTDC CHARACTER (1),
    3 ACCTDP CHARACTER (1),
    3 ACCTDH CHARACTER (1),
    3 ACCTDV CHARACTER (1),
    3 ACCTDO CHARACTER (5),
    3 DFHMS61 FIXED BINARY (15,0),
    3 SNAMEDA CHARACTER (1),
    3 SNAMEDC CHARACTER (1),
    3 SNAMEDP CHARACTER (1),
    3 SNAMEDH CHARACTER (1),
    3 SNAMEDV CHARACTER (1),
    3 SNAMEDO CHARACTER (18),
    3 DFHMS62 FIXED BINARY (15,0),
    3 FNAMEDA CHARACTER (1),
    3 FNAMEDC CHARACTER (1),
    3 FNAMEDP CHARACTER (1),
    3 FNAMEDH CHARACTER (1),
    3 FNAMEDV CHARACTER (1),
    3 FNAMEDO CHARACTER (12),
    3 DFHMS63 FIXED BINARY (15,0),
    3 MIDA CHARACTER (1),
    3 MIDC CHARACTER (1),
    3 MIDP CHARACTER (1),
    3 MIDH CHARACTER (1),
    3 MIDV CHARACTER (1),
    3 MIDO CHARACTER (1),
    3 DFHMS64 FIXED BINARY (15,0),
    3 TTLDA CHARACTER (1),
    3 TTLDC CHARACTER (1),
    3 TTLDP CHARACTER (1),
    3 TTLDH CHARACTER (1),
    3 TTLDV CHARACTER (1),
    3 TTLDO CHARACTER (4),
    3 DFHMS65 FIXED BINARY (15,0),
    3 TELDA CHARACTER (1),
    3 TELDC CHARACTER (1),
    3 TELDP CHARACTER (1),
    3 TELDH CHARACTER (1),
    3 TELDV CHARACTER (1),
    3 TELDO CHARACTER (10),
    3 DFHMS66 FIXED BINARY (15,0),
    3 ADDR1DA CHARACTER (1),
    3 ADDR1DC CHARACTER (1),
    3 ADDR1DP CHARACTER (1),
    3 ADDR1DH CHARACTER (1),
    3 ADDR1DV CHARACTER (1),
    3 ADDR1DO CHARACTER (24),
    3 DFHMS67 FIXED BINARY (15,0),
    3 ADDR2DA CHARACTER (1),
    3 ADDR2DC CHARACTER (1),
    3 ADDR2DP CHARACTER (1),
    3 ADDR2DH CHARACTER (1),
    3 ADDR2DV CHARACTER (1),
    3 ADDR2DO CHARACTER (24),
    3 DFHMS68 FIXED BINARY (15,0),
    3 ADDR3DA CHARACTER (1),
    3 ADDR3DC CHARACTER (1),
    3 ADDR3DP CHARACTER (1),
    3 ADDR3DH CHARACTER (1),
    3 ADDR3DV CHARACTER (1),
    3 ADDR3DO CHARACTER (24),
    3 DFHMS69 FIXED BINARY (15,0),
    3 AUTH1DA CHARACTER (1),
    3 AUTH1DC CHARACTER (1),
    3 AUTH1DP CHARACTER (1),
    3 AUTH1DH CHARACTER (1),
    3 AUTH1DV CHARACTER (1),
    3 AUTH1DO CHARACTER (32),
    3 DFHMS70 FIXED BINARY (15,0),
    3 AUTH2DA CHARACTER (1),
    3 AUTH2DC CHARACTER (1),
    3 AUTH2DP CHARACTER (1),
    3 AUTH2DH CHARACTER (1),
    3 AUTH2DV CHARACTER (1),
    3 AUTH2DO CHARACTER (32),
    3 DFHMS71 FIXED BINARY (15,0),
    3 AUTH3DA CHARACTER (1),
    3 AUTH3DC CHARACTER (1),
    3 AUTH3DP CHARACTER (1),
    3 AUTH3DH CHARACTER (1),
    3 AUTH3DV CHARACTER (1),
    3 AUTH3DO CHARACTER (32),
    3 DFHMS72 FIXED BINARY (15,0),
    3 AUTH4DA CHARACTER (1),
    3 AUTH4DC CHARACTER (1),
    3 AUTH4DP CHARACTER (1),
    3 AUTH4DH CHARACTER (1),
    3 AUTH4DV CHARACTER (1),
    3 AUTH4DO CHARACTER (32),
    3 DFHMS73 FIXED BINARY (15,0),
    3 CARDSDA CHARACTER (1),
    3 CARDSDC CHARACTER (1),
    3 CARDSDP CHARACTER (1),
    3 CARDSDH CHARACTER (1),
    3 CARDSDV CHARACTER (1),
    3 CARDSDO CHARACTER (1),
    3 DFHMS74 FIXED BINARY (15,0),
    3 IMODA CHARACTER (1),
    3 IMODC CHARACTER (1),
    3 IMODP CHARACTER (1),
    3 IMODH CHARACTER (1),
    3 IMODV CHARACTER (1),
    3 IMODO CHARACTER (2),
    3 DFHMS75 FIXED BINARY (15,0),
    3 IDAYDA CHARACTER (1),
    3 IDAYDC CHARACTER (1),
    3 IDAYDP CHARACTER (1),
    3 IDAYDH CHARACTER (1),
    3 IDAYDV CHARACTER (1),
    3 IDAYDO CHARACTER (2),
    3 DFHMS76 FIXED BINARY (15,0),
    3 IYRDA CHARACTER (1),
    3 IYRDC CHARACTER (1),
    3 IYRDP CHARACTER (1),
    3 IYRDH CHARACTER (1),
    3 IYRDV CHARACTER (1),
    3 IYRDO CHARACTER (2),
    3 DFHMS77 FIXED BINARY (15,0),
    3 RSNDA CHARACTER (1),
    3 RSNDC CHARACTER (1),
    3 RSNDP CHARACTER (1),
    3 RSNDH CHARACTER (1),
    3 RSNDV CHARACTER (1),
    3 RSNDO CHARACTER (1),
    3 DFHMS78 FIXED BINARY (15,0),
    3 CCODEDA CHARACTER (1),
    3 CCODEDC CHARACTER (1),
    3 CCODEDP CHARACTER (1),
    3 CCODEDH CHARACTER (1),
    3 CCODEDV CHARACTER (1),
    3 CCODEDO CHARACTER (1),
    3 DFHMS79 FIXED BINARY (15,0),
    3 APPRDA CHARACTER (1),
    3 APPRDC CHARACTER (1),
    3 APPRDP CHARACTER (1),
    3 APPRDH CHARACTER (1),
    3 APPRDV CHARACTER (1),
    3 APPRDO CHARACTER (3),
    3 DFHMS80 FIXED BINARY (15,0),
    3 SCODE1DA CHARACTER (1),
    3 SCODE1DC CHARACTER (1),
    3 SCODE1DP CHARACTER (1),
    3 SCODE1DH CHARACTER (1),
    3 SCODE1DV CHARACTER (1),
    3 SCODE1DO CHARACTER (1),
    3 DFHMS81 FIXED BINARY (15,0),
    3 SCODE2DA CHARACTER (1),
    3 SCODE2DC CHARACTER (1),
    3 SCODE2DP CHARACTER (1),
    3 SCODE2DH CHARACTER (1),
    3 SCODE2DV CHARACTER (1),
    3 SCODE2DO CHARACTER (1),
    3 DFHMS82 FIXED BINARY (15,0),
    3 SCODE3DA CHARACTER (1),
    3 SCODE3DC CHARACTER (1),
    3 SCODE3DP CHARACTER (1),
    3 SCODE3DH CHARACTER (1),
    3 SCODE3DV CHARACTER (1),
    3 SCODE3DO CHARACTER (1),
    3 DFHMS83 FIXED BINARY (15,0),
    3 STATTLDA CHARACTER (1),
    3 STATTLDC CHARACTER (1),
    3 STATTLDP CHARACTER (1),
    3 STATTLDH CHARACTER (1),
    3 STATTLDV CHARACTER (1),
    3 STATTLDO CHARACTER (15),
    3 DFHMS84 FIXED BINARY (15,0),
    3 STATDA CHARACTER (1),
    3 STATDC CHARACTER (1),
    3 STATDP CHARACTER (1),
    3 STATDH CHARACTER (1),
    3 STATDV CHARACTER (1),
    3 STATDO CHARACTER (2),
    3 DFHMS85 FIXED BINARY (15,0),
    3 LIMTTLDA CHARACTER (1),
    3 LIMTTLDC CHARACTER (1),
    3 LIMTTLDP CHARACTER (1),
    3 LIMTTLDH CHARACTER (1),
    3 LIMTTLDV CHARACTER (1),
    3 LIMTTLDO CHARACTER (18),
    3 DFHMS86 FIXED BINARY (15,0),
    3 LIMITDA CHARACTER (1),
    3 LIMITDC CHARACTER (1),
    3 LIMITDP CHARACTER (1),
    3 LIMITDH CHARACTER (1),
    3 LIMITDV CHARACTER (1),
    3 LIMITDO CHARACTER (8),
    3 DFHMS87 FIXED BINARY (15,0),
    3 HISTTLDA CHARACTER (1),
    3 HISTTLDC CHARACTER (1),
    3 HISTTLDP CHARACTER (1),
    3 HISTTLDH CHARACTER (1),
    3 HISTTLDV CHARACTER (1),
    3 HISTTLDO CHARACTER (71),
    3 DFHMS88 FIXED BINARY (15,0),
    3 HIST1DA CHARACTER (1),
    3 HIST1DC CHARACTER (1),
    3 HIST1DP CHARACTER (1),
    3 HIST1DH CHARACTER (1),
    3 HIST1DV CHARACTER (1),
    3 HIST1DO CHARACTER (61),
    3 DFHMS89 FIXED BINARY (15,0),
    3 HIST2DA CHARACTER (1),
    3 HIST2DC CHARACTER (1),
    3 HIST2DP CHARACTER (1),
    3 HIST2DH CHARACTER (1),
    3 HIST2DV CHARACTER (1),
    3 HIST2DO CHARACTER (61),
    3 DFHMS90 FIXED BINARY (15,0),
    3 HIST3DA CHARACTER (1),
    3 HIST3DC CHARACTER (1),
    3 HIST3DP CHARACTER (1),
    3 HIST3DH CHARACTER (1),
    3 HIST3DV CHARACTER (1),
    3 HIST3DO CHARACTER (61),
    3 DFHMS91 FIXED BINARY (15,0),
    3 MSGDA CHARACTER (1),
    3 MSGDC CHARACTER (1),
    3 MSGDP CHARACTER (1),
    3 MSGDH CHARACTER (1),
    3 MSGDV CHARACTER (1),
    3 MSGDO CHARACTER (70),
    3 DFHMS92 FIXED BINARY (15,0),
    3 VFYDA CHARACTER (1),
    3 VFYDC CHARACTER (1),
    3 VFYDP CHARACTER (1),
    3 VFYDH CHARACTER (1),
    3 VFYDV CHARACTER (1),
    3 VFYDO CHARACTER (1),
    3 DFHMS93 CHARACTER(1);

 /* END OF MAP DEFINITION */

 DECLARE 1 ACCTERRI AUTOMATIC UNALIGNED,
    3 DFHMS94 CHARACTER (12),
    3 TRANEL FIXED BINARY (15,0),
    3 TRANEF CHARACTER (1),
    3 DFHMS95  CHARACTER (4),
    3 TRANEI CHARACTER (4),
    3 PGMEL FIXED BINARY (15,0),
    3 PGMEF CHARACTER (1),
    3 DFHMS96  CHARACTER (4),
    3 PGMEI CHARACTER (8),
    3 RSNEL FIXED BINARY (15,0),
    3 RSNEF CHARACTER (1),
    3 DFHMS97  CHARACTER (4),
    3 RSNEI CHARACTER (60),
    3 FILEEL FIXED BINARY (15,0),
    3 FILEEF CHARACTER (1),
    3 DFHMS98  CHARACTER (4),
    3 FILEEI CHARACTER (22),
    3 DFHMS99 CHARACTER(1);

 DECLARE 1 ACCTERRO BASED(ADDR(ACCTERRI)) UNALIGNED,
    3 DFHMS100 CHARACTER (12),
    3 DFHMS101 FIXED BINARY (15,0),
    3 TRANEA CHARACTER (1),
    3 TRANEC CHARACTER (1),
    3 TRANEP CHARACTER (1),
    3 TRANEH CHARACTER (1),
    3 TRANEV CHARACTER (1),
    3 TRANEO CHARACTER (4),
    3 DFHMS102 FIXED BINARY (15,0),
    3 PGMEA CHARACTER (1),
    3 PGMEC CHARACTER (1),
    3 PGMEP CHARACTER (1),
    3 PGMEH CHARACTER (1),
    3 PGMEV CHARACTER (1),
    3 PGMEO CHARACTER (8),
    3 DFHMS103 FIXED BINARY (15,0),
    3 RSNEA CHARACTER (1),
    3 RSNEC CHARACTER (1),
    3 RSNEP CHARACTER (1),
    3 RSNEH CHARACTER (1),
    3 RSNEV CHARACTER (1),
    3 RSNEO CHARACTER (60),
    3 DFHMS104 FIXED BINARY (15,0),
    3 FILEEA CHARACTER (1),
    3 FILEEC CHARACTER (1),
    3 FILEEP CHARACTER (1),
    3 FILEEH CHARACTER (1),
    3 FILEEV CHARACTER (1),
    3 FILEEO CHARACTER (22),
    3 DFHMS105 CHARACTER(1);

 /* END OF MAP DEFINITION */

 DECLARE 1 ACCTMSGI AUTOMATIC UNALIGNED,
    3 DFHMS106 CHARACTER (12),
    3 MSGL FIXED BINARY (15,0),
    3 MSGF CHARACTER (1),
    3 DFHMS107  CHARACTER (4),
    3 MSGI CHARACTER (79),
    3 DFHMS108 CHARACTER(1);

 DECLARE 1 ACCTMSGO BASED(ADDR(ACCTMSGI)) UNALIGNED,
    3 DFHMS109 CHARACTER (12),
    3 DFHMS110 FIXED BINARY (15,0),
    3 MSGA CHARACTER (1),
    3 MSGC CHARACTER (1),
    3 MSGP CHARACTER (1),
    3 MSGH CHARACTER (1),
    3 MSGV CHARACTER (1),
    3 MSGO CHARACTER (79),
    3 DFHMS111 CHARACTER(1);

 /* END OF MAP DEFINITION */

 DECLARE 1 CONFIRMI AUTOMATIC UNALIGNED,
    3 DFHMS112 CHARACTER (12),
    3 DFHMS113 CHARACTER(1);

 DECLARE 1 CONFIRMO BASED(ADDR(CONFIRMI)) UNALIGNED,
    3 DFHMS114 CHARACTER (12),
    3 DFHMS115 CHARACTER(1);

 /* END OF MAP DEFINITION */

 DECLARE 1 ZCCTMN2I AUTOMATIC UNALIGNED,
    3 DFHMS116 CHARACTER (12),
    3 MNUNAMEL FIXED BINARY (15,0),
    3 MNUNAMEF CHARACTER (1),
    3 DFHMS117  CHARACTER (4),
    3 MNUNAMEI CHARACTER (60),
    3 DFHMS118 CHARACTER(1);

 DECLARE 1 ZCCTMN2O BASED(ADDR(ZCCTMN2I)) UNALIGNED,
    3 DFHMS119 CHARACTER (12),
    3 DFHMS120 FIXED BINARY (15,0),
    3 MNUNAMEA CHARACTER (1),
    3 MNUNAMEC CHARACTER (1),
    3 MNUNAMEP CHARACTER (1),
    3 MNUNAMEH CHARACTER (1),
    3 MNUNAMEV CHARACTER (1),
    3 MNUNAMEO CHARACTER (60),
    3 DFHMS121 CHARACTER(1);

 /* END OF MAP DEFINITION */

