//CUSTREPO JOB 'BNK CUST REPRO',CLASS=A,MSGCLASS=A
//*
//STEP01    EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//CUSFILE   DD DSN=MFI01V.MFIDEMO.BNKCUST,
//             DISP=SHR
//BKPFILE   DD DSN=MFI01V.MFIDEMO.BNKCUST.BKUP(+1),
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(10,10),RLSE),
//             DCB=(RECFM=FB,LRECL=250)
//SYSIN     DD *
     REPRO INFILE(CUSFILE) OUTFILE(BKPFILE)
/*

