//GDGBASE JOB 'GDGBASE',CLASS=A,MSGCLASS=A
//*
//STEP01      EXEC PGM=IDCAMS
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//SYSIN     DD *

 DEFINE GDG(NAME(MFI01V.MFIDEMO.BNKCUST.BKUP) -                        
       LIMIT(10) NOEMPTY SCRATCH)
/*
//


