//ZBNKLIST JOB 'ZBNKLIST',CLASS=A,MSGCLASS=A
//*
//BANKDO   EXEC PGM=ZBNKPRT2
//REPT10   DD SYSOUT=*
//BANK10   DD DSN=EBC.BANK10,DISP=OLD
//SYSOUT   DD SYSOUT=A


